<a href="https://colab.research.google.com/github/Indrejue/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Antony_Farag_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [6]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-09-02 20:51:07--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.86.126
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.86.126|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  34.7MB/s    in 6.2s

2020-09-02 20:51:14 (31.4 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [7]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [8]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [9]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [10]:
##### YOUR CODE HERE #####

#import libraries
import pandas as pd
#set number of rows and colums to show maximum
pd.set_option('display.max_row', 100)
pd.set_option('display.max_column', 50)

In [11]:
#load the CSV files needed into dataframes to work with
orders = pd.read_csv('orders.csv')
prod = pd.read_csv('products.csv')
prior_ord=pd.read_csv('order_products__prior.csv')
train_ord=pd.read_csv('order_products__train.csv')
#check data frames were imported with head and shape analysis
print(orders.shape)
print(orders.head())
print(prod.shape)
print(prod.head())
print(prior_ord.shape)
print(prior_ord.head())
print(train_ord.shape)
print(train_ord.head())

(3421083, 7)
   order_id  user_id eval_set  order_number  order_dow  order_hour_of_day  \
0   2539329        1    prior             1          2                  8
1   2398795        1    prior             2          3                  7
2    473747        1    prior             3          3                 12
3   2254736        1    prior             4          4                  7
4    431534        1    prior             5          4                 15

   days_since_prior_order
0                     NaN
1                    15.0
2                    21.0
3                    29.0
4                    28.0
(49688, 4)
   product_id                                       product_name  aisle_id  \
0           1                         Chocolate Sandwich Cookies        61
1           2                                   All-Seasons Salt       104
2           3               Robust Golden Unsweetened Oolong Tea        94
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...        38
4           5                          Green Chile Anytime Sauce         5

   department_id
0             19
1             13
2              7
3              1
4             13
(32434489, 4)
   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0
(1384617, 4)
   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [12]:
#merge the 2 dataframes containing customer order information
cust_order=pd.concat([prior_ord,train_ord])
cust_order.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
print (cust_order.shape)
cust_order.tail()

(33819106, 4)

         order_id  product_id  add_to_cart_order  reordered
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

In [14]:
#check the number or rows is equal to the zum of rows from original dataframes
32434489+1384617

33819106

In [15]:
#reset all the row index so there are no repeats
cust_order = cust_order.reset_index()
cust_order.tail()

            index  order_id  product_id  add_to_cart_order  reordered
33819101  1384612   3421063       14233                  3          1
33819102  1384613   3421063       35548                  4          1
33819103  1384614   3421070       35951                  1          1
33819104  1384615   3421070       16953                  2          1
33819105  1384616   3421070        4724                  3          1

In [16]:
#drop from cust order DF added index row and reordered row
cust_order=cust_order.drop(['index','reordered'], axis=1)
cust_order.head()

   order_id  product_id  add_to_cart_order
0         2       33120                  1
1         2       28985                  2
2         2        9327                  3
3         2       45918                  4
4         2       30035                  5

In [17]:
#sort by order id so it makes sense
cust_order=cust_order.sort_values('order_id')
cust_order.head()

          order_id  product_id  add_to_cart_order
32434489         1       49302                  1
32434491         1       10246                  3
32434492         1       49683                  4
32434493         1       43633                  5
32434494         1       13176                  6

In [18]:
#reset index yet again
cust_order=cust_order.reset_index()
cust_order.head()

      index  order_id  product_id  add_to_cart_order
0  32434489         1       49302                  1
1  32434491         1       10246                  3
2  32434492         1       49683                  4
3  32434493         1       43633                  5
4  32434494         1       13176                  6

In [19]:
#drop new index column again
cust_order = cust_order.drop('index',axis=1)
cust_order.head()

   order_id  product_id  add_to_cart_order
0         1       49302                  1
1         1       10246                  3
2         1       49683                  4
3         1       43633                  5
4         1       13176                  6

In [20]:
#adding product information to cust order DF
cust_order_info=pd.merge(cust_order,prod,on='product_id',how='inner')
cust_order_info.head()

,order_id,product_id,add_to_cart_order,product_name,aisle_id,department_id
0,1,49302,1,Bulgarian Yogurt,120,16
1,38841,49302,5,Bulgarian Yogurt,120,16
2,45900,49302,19,Bulgarian Yogurt,120,16
3,76491,49302,2,Bulgarian Yogurt,120,16
4,78201,49302,5,Bulgarian Yogurt,120,16

In [21]:
#resort by order ID again and reindex
cust_order_info=cust_order_info.sort_values('order_id')
cust_order_info=cust_order_info.reset_index()
cust_order_info.head()

,index,order_id,product_id,add_to_cart_order,product_name,aisle_id,department_id
0,0,1,49302,1,Bulgarian Yogurt,120,16
1,124787,1,43633,5,Lightly Smoked Sardines in Olive Oil,95,15
2,125464,1,13176,6,Bag of Organic Bananas,24,4
3,520394,1,47209,7,Organic Hass Avocado,24,4
4,741271,1,22035,8,Organic Whole String Cheese,21,16

In [22]:
#drop index sisle id and department id
cust_order_info=cust_order_info.drop(['index','aisle_id','department_id'],axis=1)
cust_order_info.head()

,order_id,product_id,add_to_cart_order,product_name
0,1,49302,1,Bulgarian Yogurt
1,1,43633,5,Lightly Smoked Sardines in Olive Oil
2,1,13176,6,Bag of Organic Bananas
3,1,47209,7,Organic Hass Avocado
4,1,22035,8,Organic Whole String Cheese

In [23]:
#count up the number of instances of each product type
prod_count = cust_order_info['product_name'].value_counts()

In [26]:
#show only the top 10 items
prod_count=prod_count[:10]
prod_count

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [27]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [29]:
# table2 -> tidy
#reset index
table2=table2.reset_index()
table2

   level_0       index  John Smith  Jane Doe  Mary Johnson
0        0  treatmenta         NaN      16.0           3.0
1        1  treatmentb         2.0      11.0           1.0

In [ ]:
#format in tidy format

In [ ]:
# tidy -> table2

In [ ]:
flights = sns.load_dataset('flights')

In [ ]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####